OpenDTEF-v1812/tutorials/multiphase/reactingTwoPhaseEulerFoam/laminar/bubbleColumnEvaporating/system/continuityFunctions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

inletMassFlowRate
{
    type    surfaceFieldValue;
    libs    ("libfieldFunctionObjects.so");

    fields
    (
        alphaRhoPhi.gas
        alphaRhoPhi.liquid
    );

    writeFields     false;
    log             true;
    surfaceFormat   null;

    regionType      patch;
    name            inlet;

    operation       sum;

    writeControl   timeStep;
}

outletMassFlowRate
{
    type    surfaceFieldValue;
    libs    ("libfieldFunctionObjects.so");

    fields
    (
        alphaRhoPhi.gas
        alphaRhoPhi.liquid
    );

    writeFields     false;
    log             true;
    surfaceFormat   null;

    regionType      patch;
    name            outlet;

    operation       sum;

    writeControl   timeStep;
}

totalMass
{
    name    error;
    type    coded;
    libs    ("libutilityFunctionObjects.so");

    code
    #{
        const volScalarField& alphaGas =
            mesh().lookupObject<volScalarField>("alpha.gas");
        const volScalarField& alphaLiquid =
            mesh().lookupObject<volScalarField>("alpha.liquid");

        const volScalarField& rhoGas =
            mesh().lookupObject<volScalarField>("thermo:rho.gas");
        const volScalarField& rhoLiquid =
            mesh().lookupObject<volScalarField>("thermo:rho.liquid");

        const volScalarField& dmdt =
            mesh().lookupObject<volScalarField>("dmdt.gasAndLiquid");

        const scalarField& v = mesh().V();

        Info<< "coded totalMass output:" << endl
            << "    volIntegrate(all) for alpha.gas*rho.gas = "
            << gSum(alphaGas*rhoGas*v) << endl
            << "    volIntegrate(all) for alpha.liquid*rho.liquid = "
            << gSum(alphaLiquid*rhoLiquid*v) << endl
            << "    volIntegrate(all) for dmdt = "
            << gSum(dmdt*v) << endl
            << endl;
    #};
}

// ************************************************************************* //
